; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p13)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 - Aircraft
 c1 c2 c3 c4 c5 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c2)
(fuel-level a2 f2) (at a2 c3)
(at p1 c1)
(at p2 c4)
(at p3 c5)
(at p4 c2)
(at p5 c1)
(at p6 c5)
(at p7 c1)
(at p8 c2)
(at p9 c1)
(at p10 c1)
(at p11 c3)
(at p12 c1)
(at p13 c5)
(at p14 c5)
(at p15 c5)
(at p16 c2)
(at p17 c1)
(at p18 c4)
(at p19 c3)
(at p20 c5)
(at p21 c5)
(at p22 c5)
(at p23 c2)
)
(:goal (and
(at a1 c2)
(at a2 c3)
(at p1 c4)
(at p2 c4)
(at p3 c1)
(at p4 c1)
(at p5 c3)
(at p6 c2)
(at p7 c3)
(at p8 c4)
(at p9 c2)
(at p10 c3)
(at p11 c2)
(at p12 c3)
(at p13 c1)
(at p14 c1)
(at p15 c2)
(at p16 c4)
(at p17 c2)
(at p18 c3)
(at p19 c5)
(at p20 c4)
(at p21 c5)
(at p22 c1)
(at p23 c2)
))
)

; plan
1. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 4 of 25
2. (board p1 a1 c1)
   deleted: (at p1 c1)
   added: (in p1 a1)
   goals met: 4 of 25
3. (fly a1 c1 c4 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 4 of 25
4. (debark p1 a1 c4)
   deleted: (in p1 a1)
   added: (at p1 c4)
   goals met: 5 of 25
5. (fly a2 c3 c5 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c5) (fuel-level a2 f1)
   goals met: 4 of 25
6. (board p3 a2 c5)
   deleted: (at p3 c5)
   added: (in p3 a2)
   goals met: 4 of 25
7. (fly a2 c5 c1 f1 f0)
   deleted: (at a2 c5) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 4 of 25
8. (debark p3 a2 c1)
   deleted: (in p3 a2)
   added: (at p3 c1)
   goals met: 5 of 25
9. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 5 of 25
10. (fly a1 c4 c2 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 6 of 25
11. (board p4 a1 c2)
   deleted: (at p4 c2)
   added: (in p4 a1)
   goals met: 6 of 25
12. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 5 of 25
13. (debark p4 a1 c1)
   deleted: (in p4 a1)
   added: (at p4 c1)
   goals met: 6 of 25
14. (board p5 a1 c1)
   deleted: (at p5 c1)
   added: (in p5 a1)
   goals met: 6 of 25
15. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 6 of 25
16. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 6 of 25
17. (debark p5 a1 c3)
   deleted: (in p5 a1)
   added: (at p5 c3)
   goals met: 7 of 25
18. (fly a1 c3 c5 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 7 of 25
19. (board p6 a1 c5)
   deleted: (at p6 c5)
   added: (in p6 a1)
   goals met: 7 of 25
20. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 7 of 25
21. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 8 of 25
22. (debark p6 a1 c2)
   deleted: (in p6 a1)
   added: (at p6 c2)
   goals met: 9 of 25
23. (board p7 a2 c1)
   deleted: (at p7 c1)
   added: (in p7 a2)
   goals met: 9 of 25
24. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 9 of 25
25. (fly a2 c1 c3 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 10 of 25
26. (debark p7 a2 c3)
   deleted: (in p7 a2)
   added: (at p7 c3)
   goals met: 11 of 25
27. (board p8 a1 c2)
   deleted: (at p8 c2)
   added: (in p8 a1)
   goals met: 11 of 25
28. (fly a1 c2 c4 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 10 of 25
29. (debark p8 a1 c4)
   deleted: (in p8 a1)
   added: (at p8 c4)
   goals met: 11 of 25
30. (fly a2 c3 c1 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 10 of 25
31. (board p9 a2 c1)
   deleted: (at p9 c1)
   added: (in p9 a2)
   goals met: 10 of 25
32. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 10 of 25
33. (fly a2 c1 c2 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 10 of 25
34. (debark p9 a2 c2)
   deleted: (in p9 a2)
   added: (at p9 c2)
   goals met: 11 of 25
35. (fly a2 c2 c1 f1 f0)
   deleted: (at a2 c2) (fuel-level a2 f1)
   added: (at a2 c1) (fuel-level a2 f0)
   goals met: 11 of 25
36. (board p10 a2 c1)
   deleted: (at p10 c1)
   added: (in p10 a2)
   goals met: 11 of 25
37. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 11 of 25
38. (fly a2 c1 c3 f2 f1)
   deleted: (at a2 c1) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 12 of 25
39. (debark p10 a2 c3)
   deleted: (in p10 a2)
   added: (at p10 c3)
   goals met: 13 of 25
40. (board p11 a2 c3)
   deleted: (at p11 c3)
   added: (in p11 a2)
   goals met: 13 of 25
41. (fly a2 c3 c2 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 12 of 25
42. (debark p11 a2 c2)
   deleted: (in p11 a2)
   added: (at p11 c2)
   goals met: 13 of 25
43. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 25
44. (fly a1 c4 c1 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 13 of 25
45. (board p12 a1 c1)
   deleted: (at p12 c1)
   added: (in p12 a1)
   goals met: 13 of 25
46. (fly a1 c1 c3 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 13 of 25
47. (debark p12 a1 c3)
   deleted: (in p12 a1)
   added: (at p12 c3)
   goals met: 14 of 25
48. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 14 of 25
49. (fly a1 c3 c5 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 14 of 25
50. (board p13 a1 c5)
   deleted: (at p13 c5)
   added: (in p13 a1)
   goals met: 14 of 25
51. (fly a1 c5 c1 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 14 of 25
52. (debark p13 a1 c1)
   deleted: (in p13 a1)
   added: (at p13 c1)
   goals met: 15 of 25
53. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 25
54. (fly a1 c1 c5 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 15 of 25
55. (board p14 a1 c5)
   deleted: (at p14 c5)
   added: (in p14 a1)
   goals met: 15 of 25
56. (fly a1 c5 c1 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 15 of 25
57. (debark p14 a1 c1)
   deleted: (in p14 a1)
   added: (at p14 c1)
   goals met: 16 of 25
58. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 16 of 25
59. (fly a1 c1 c5 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 16 of 25
60. (board p15 a1 c5)
   deleted: (at p15 c5)
   added: (in p15 a1)
   goals met: 16 of 25
61. (fly a1 c5 c2 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 17 of 25
62. (debark p15 a1 c2)
   deleted: (in p15 a1)
   added: (at p15 c2)
   goals met: 18 of 25
63. (board p16 a1 c2)
   deleted: (at p16 c2)
   added: (in p16 a1)
   goals met: 18 of 25
64. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 25
65. (fly a1 c2 c4 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 17 of 25
66. (debark p16 a1 c4)
   deleted: (in p16 a1)
   added: (at p16 c4)
   goals met: 18 of 25
67. (fly a1 c4 c1 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 18 of 25
68. (board p17 a1 c1)
   deleted: (at p17 c1)
   added: (in p17 a1)
   goals met: 18 of 25
69. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 18 of 25
70. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 19 of 25
71. (debark p17 a1 c2)
   deleted: (in p17 a1)
   added: (at p17 c2)
   goals met: 20 of 25
72. (fly a1 c2 c4 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 19 of 25
73. (board p18 a1 c4)
   deleted: (at p18 c4)
   added: (in p18 a1)
   goals met: 19 of 25
74. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 25
75. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 19 of 25
76. (debark p18 a1 c3)
   deleted: (in p18 a1)
   added: (at p18 c3)
   goals met: 20 of 25
77. (board p19 a1 c3)
   deleted: (at p19 c3)
   added: (in p19 a1)
   goals met: 20 of 25
78. (fly a1 c3 c5 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 20 of 25
79. (debark p19 a1 c5)
   deleted: (in p19 a1)
   added: (at p19 c5)
   goals met: 21 of 25
80. (board p20 a1 c5)
   deleted: (at p20 c5)
   added: (in p20 a1)
   goals met: 21 of 25
81. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 21 of 25
82. (fly a1 c5 c4 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 21 of 25
83. (debark p20 a1 c4)
   deleted: (in p20 a1)
   added: (at p20 c4)
   goals met: 22 of 25
84. (fly a1 c4 c5 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c5) (fuel-level a1 f0)
   goals met: 22 of 25
85. (board p22 a1 c5)
   deleted: (at p22 c5)
   added: (in p22 a1)
   goals met: 22 of 25
86. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 22 of 25
87. (fly a1 c5 c1 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 22 of 25
88. (debark p22 a1 c1)
   deleted: (in p22 a1)
   added: (at p22 c1)
   goals met: 23 of 25
89. (fly a1 c1 c2 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 24 of 25
90. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 24 of 25
91. (fly a2 c2 c3 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 25 of 25
